turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC4B.atdf
        <module name="EDP" id="I8320" version="1.0.0">
          <instance name="EDP">
            <signals>
              <signal group="TCK" function="default" pad="TCK"/>
              <signal group="TDI" function="Jtag_Alt" pad="PA24"/>
              <signal group="TDO" function="Jtag_Alt" pad="PA23"/>
              <signal group="TMS" function="Jtag_Alt" pad="PA03"/>
            </signals>
          </instance>
        </module>
        <module name="EIC" id="I7529" version="3.0.2">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x400F1000"/>
            <signals>
              <signal group="EXTINT" index="0" function="C" pad="PB01"/>
              <signal group="EXTINT" index="1" function="C" pad="PA06"/>
              <signal group="EXTINT" index="1" function="C" pad="PA16"/>
              <signal group="EXTINT" index="2" function="C" pad="PA04"/>
              <signal group="EXTINT" index="2" function="C" pad="PA17"/>
              <signal group="EXTINT" index="3" function="C" pad="PA05"/>
              <signal group="EXTINT" index="3" function="C" pad="PA18"/>
              <signal group="EXTINT" index="4" function="C" pad="PA07"/>
              <signal group="EXTINT" index="4" function="C" pad="PA19"/>
              <signal group="EXTINT" index="5" function="C" pad="PA20"/>
              <signal group="EXTINT" index="6" function="C" pad="PA21"/>
              <signal group="EXTINT" index="7" function="C" pad="PA22"/>
              <signal group="EXTINT" index="8" function="C" pad="PA23"/>
            </signals>
            <parameters>
              <param name="STD_NUM" value="8"/>
              <param name="EIC_EDGE_IRQ" value="0"/>
              <param name="EIC_FALLING_EDGE" value="0"/>
              <param name="EIC_FILTER_OFF" value="0"/>
              <param name="EIC_FILTER_ON" value="1"/>
              <param name="EIC_HIGH_LEVEL" value="1"/>
              <param name="EIC_LEVEL_IRQ" value="1"/>
              <param name="EIC_LOW_LEVEL" value="0"/>
              <param name="EIC_RISING_EDGE" value="1"/>
              <param name="EIC_SYNC" value="0"/>
              <param name="EIC_USE_ASYNC" value="1"/>
              <param name="INSTANCE_ID" value="100"/>
            </parameters>
          </instance>
        </module>
        <module name="FLASHCALW" id="I8322" version="1.1.0">
          <instance name="HFLASHC">
            <register-group name="HFLASHC" name-in-module="FLASHCALW" address-space="base" offset="0x400A0000"/>
            <signals>
              <signal group="VMARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="FLASH_SIZE" value="262144"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="PAGES" value="512"/>
              <param name="PAGES_PR_REGION" value="32"/>
                  <!--  From Datasheet section "Electrical Characteristics","Flash Characteristics" table "Maximum operating Frequency" -->
                  <param name="PSM_0_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_0_FRMLP_FWS_0_MAX_FREQ" value="18000000"/>
                  <param name="PSM_0_FRMLP_FWS_1_MAX_FREQ" value="36000000"/>
                  <param name="PSM_0_FRMHS_FWS_0_MAX_FREQ" value="25000000"/>
                  <param name="PSM_0_FRMHS_FWS_1_MAX_FREQ" value="50000000"/>
                  <param name="PSM_1_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
                  <param name="PSM_1_FRMLP_FWS_0_MAX_FREQ" value="8000000"/>
                  <param name="PSM_1_FRMLP_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="INSTANCE_ID" value="32"/>
            <param name="IC9692" value="true"/></parameters>
          </instance>
        </module>
        <module name="FUSES" id="I8322" version="1.1.0">
          <instance name="FUSES">
            <register-group address-space="base" offset="0x00800000" name-in-module="USERPAGE_FUSES" name="USERPAGE_FUSES"/>
            <register-group address-space="fuses" offset="0x400A0000" name-in-module="FLASH_FUSES" name="FLASH_FUSES"/>
          </instance>
        </module>
        <module name="FREQM" id="I7530" version="3.1.1">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x400E0C00"/>
            <parameters>
              <param name="CPU" value="0"/>
              <param name="CRIPOSC" value="10"/>
              <param name="DFLL0" value="9"/>
              <param name="FLO_JITTER" value="27"/>
              <param name="GENCLK0" value="11"/>
              <param name="GENCLK1" value="12"/>
              <param name="GENCLK2" value="13"/>
              <param name="GENCLK3" value="14"/>
              <param name="GENCLK4" value="15"/>
              <param name="GENCLK5" value="16"/>
              <param name="GENCLK6" value="17"/>
              <param name="GENCLK7" value="18"/>
              <param name="GENCLK8" value="19"/>
              <param name="GENCLK9" value="20"/>
              <param name="GENCLK10" value="21"/>
              <param name="HSB" value="1"/>
              <param name="NUM_CLK" value="28"/>
              <param name="NUM_REF_CLK" value="4"/>
              <param name="OSC0" value="6"/>
              <param name="OSC32" value="7"/>
              <param name="PBA" value="2"/>
              <param name="PBB" value="3"/>
              <param name="PBC" value="4"/>
              <param name="PLL0" value="26"/>
              <param name="RCFAST" value="24"/>
              <param name="RCOSC" value="8"/>
              <param name="RC1M" value="25"/>
              <param name="RC32K" value="7"/>
              <param name="RC80M" value="23"/>
              <param name="REFSEL_BITS" value="2"/>
              <param name="REF_OSC32" value="1"/>
              <param name="REF_RCOSC" value="0"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
        </module>
        <module name="GLOC" id="I7551" version="1.0.2">
          <instance name="GLOC">
            <register-group name="GLOC" name-in-module="GLOC" address-space="base" offset="0x40060000"/>
            <signals>
              <signal group="IN" index="0" function="D" pad="PA06"/>
              <signal group="IN" index="0" function="D" pad="PA20"/>
              <signal group="IN" index="1" function="D" pad="PA04"/>
              <signal group="IN" index="1" function="D" pad="PA21"/>
              <signal group="IN" index="2" function="D" pad="PA05"/>
              <signal group="IN" index="2" function="D" pad="PA22"/>
              <signal group="IN" index="3" function="D" pad="PA07"/>
              <signal group="IN" index="3" function="D" pad="PA23"/>
              <signal group="IN" index="4" function="C" pad="PB06"/>
              <signal group="IN" index="5" function="C" pad="PB07"/>
              <signal group="IN" index="6" function="C" pad="PB08"/>
              <signal group="IN" index="7" function="C" pad="PB09"/>
              <signal group="OUT" index="0" function="D" pad="PA08"/>
              <signal group="OUT" index="0" function="D" pad="PA24"/>
              <signal group="OUT" index="1" function="C" pad="PB10"/>
            </signals>
            <parameters>
              <param name="GCLK_NUM" value="5"/>
              <param name="LUTS" value="2"/>
              <param name="INSTANCE_ID" value="15"/>
            </parameters>
          </instance>
        </module>
        <module name="GPIO" id="I7512" version="2.1.5">
          <instance name="GPIO">
            <register-group name="GPIO" name-in-module="GPIO" address-space="base" offset="0x400E1000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="26" function="default" pad="PA26"/>
              <signal group="P" index="32" function="default" pad="PB00"/>
              <signal group="P" index="33" function="default" pad="PB01"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="36" function="default" pad="PB04"/>
              <signal group="P" index="37" function="default" pad="PB05"/>
              <signal group="P" index="38" function="default" pad="PB06"/>
              <signal group="P" index="39" function="default" pad="PB07"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
              <signal group="P" index="46" function="default" pad="PB14"/>
              <signal group="P" index="47" function="default" pad="PB15"/>
            </signals>
            <parameters>
              <param name="GPIO_IRQ_MSB" value="11"/>
              <param name="GPIO_MAX_IRQ_MSB" value="11"/>
              <param name="GPIO_PADDR_BITS" value="11"/>
              <param name="GPIO_PINS_MSB" value="95"/>
              <param name="IRQS_PER_GROUP" value="8"/>
              <param name="NUMBER_OF_PINS" value="96"/>
              <param name="PADDR_MSB" value="10"/>
              <param name="PDATA_MSB" value="31"/>
              <param name="PORT_LENGTH" value="3"/>
              <param name="INSTANCE_ID" value="68"/>
            </parameters>
          </instance>
        </module>
        <module name="HCACHE" id="I8323" version="1.0.1">
          <instance name="HCACHE">
            <register-group name="HCACHE" name-in-module="HCACHE" address-space="base" offset="0x400A0400"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="HMATRIXB" id="I7638" version="1.3.0">
          <instance name="HMATRIX">
            <register-group name="HMATRIX" name-in-module="HMATRIXB" address-space="base" offset="0x400A1000"/>
            <parameters>
              <param name="MASTER_NUM" value="6"/>
              <param name="MASTER_CPU_IDCODE" value="0"/>
              <param name="MASTER_CPU_SYS" value="1"/>
              <param name="MASTER_SMAP" value="2"/>
              <param name="MASTER_PDCA" value="3"/>
              <param name="MASTER_USBC" value="4"/>
              <param name="MASTER_CRCCU" value="5"/>
              <param name="SLAVE_NUM" value="8"/>
              <param name="SLAVE_FLASH" value="0"/>
              <param name="SLAVE_HTOP0" value="1"/>
              <param name="SLAVE_HTOP1" value="2"/>
              <param name="SLAVE_HTOP2" value="3"/>
              <param name="SLAVE_HTOP3" value="4"/>
              <param name="SLAVE_HRAMC0" value="5"/>
              <param name="SLAVE_HRAMC1" value="6"/>
              <param name="SLAVE_AESA" value="7"/>
              <param name="INSTANCE_ID" value="34"/>
            </parameters>
          </instance>
        </module>
