turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC4B.atdf
      <value-group name="IISC_SR__TXUR">
        <value name="NO" caption="No underrun" value="0"/>
        <value name="YES" caption="The last bit of the last data written to the register THR has been set. Until the next write to THR, data will be sent according to MR.TXSAME field" value="1"/>
      </value-group>
      <value-group name="IISC_SR__TXURCH">
        <value name="LEFT" caption="Underrun first occurred on left channel" value="0"/>
        <value name="RIGHT" caption="Underrun first occurred on right channel" value="1"/>
      </value-group>
      <value-group name="IISC_SCR__RXOR">
        <value name="NO" caption="No effect" value="0"/>
        <value name="CLEAR" caption="Clears the corresponding SR bit" value="1"/>
      </value-group>
      <value-group name="IISC_SCR__TXUR">
        <value name="NO" caption="No effect" value="0"/>
        <value name="CLEAR" caption="Clears the corresponding SR bit" value="1"/>
      </value-group>
      <value-group name="IISC_SSR__RXOR">
        <value name="NO" caption="No effect" value="0"/>
        <value name="SET" caption="Sets corresponding SR bit" value="1"/>
      </value-group>
      <value-group name="IISC_SSR__TXUR">
        <value name="NO" caption="No effect" value="0"/>
        <value name="SET" caption="Sets corresponding SR bit" value="1"/>
      </value-group>
      <value-group name="IISC_IER__RXOR">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IER__RXRDY">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IER__TXRDY">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IER__TXUR">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IDR__RXOR">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IDR__RXRDY">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IDR__TXRDY">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IDR__TXUR">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IMR__RXOR">
        <value name="DISABLED" caption="The corresponding interrupt is disabled" value="0"/>
        <value name="ENABLED" caption="The corresponding interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="IISC_IMR__RXRDY">
        <value name="DISABLED" caption="The corresponding interrupt is disabled" value="0"/>
        <value name="ENABLED" caption="The corresponding interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="IISC_IMR__TXRDY">
        <value name="DISABLED" caption="The corresponding interrupt is disabled" value="0"/>
        <value name="ENABLED" caption="The corresponding interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="IISC_IMR__TXUR">
        <value name="DISABLED" caption="The corresponding interrupt is disabled" value="0"/>
        <value name="ENABLED" caption="The corresponding interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="IISC_PARAMETER__FORMAT">
        <value name="I2S" caption="I2S format, stereo with IWS low for left channel" value="0"/>
      </value-group>
    </module>
    <module name="LCDCA" id="I7572" version="1.0.0" caption="LCD Controller">
      <register-group name="LCDCA" caption="LCD Controller">
        <register name="CR" offset="0x0" rw="W" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="DIS" caption="Disable" mask="0x1"/>
          <bitfield name="EN" caption="Enable" mask="0x2"/>
          <bitfield name="FC0DIS" caption="Frame Counter 0 Disable" mask="0x4"/>
          <bitfield name="FC0EN" caption="Frame Counter 0 Enable" mask="0x8"/>
          <bitfield name="FC1DIS" caption="Frame Counter 1 Disable" mask="0x10"/>
          <bitfield name="FC1EN" caption="Frame Counter 1 Enable" mask="0x20"/>
          <bitfield name="FC2DIS" caption="Frame Counter 2 Disable" mask="0x40"/>
          <bitfield name="FC2EN" caption="Frame Counter 2 Enable" mask="0x80"/>
          <bitfield name="CDM" caption="Clear Display Memory" mask="0x100"/>
          <bitfield name="WDIS" caption="Wake up Disable" mask="0x200"/>
          <bitfield name="WEN" caption="Wake up Enable" mask="0x400"/>
          <bitfield name="BSTART" caption="Blinking Start" mask="0x800"/>
          <bitfield name="BSTOP" caption="Blinking Stop" mask="0x1000"/>
          <bitfield name="CSTART" caption="Circular Shift Start" mask="0x2000"/>
          <bitfield name="CSTOP" caption="Circular Shift Stop" mask="0x4000"/>
        </register>
        <register name="CFG" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Configuration Register">
          <bitfield name="XBIAS" caption="External Bias Generation" mask="0x1"/>
          <bitfield name="WMOD" caption="Waveform Mode" mask="0x2"/>
          <bitfield name="BLANK" caption="Blank LCD" mask="0x4"/>
          <bitfield name="LOCK" caption="Lock" mask="0x8"/>
          <bitfield name="DUTY" caption="Duty Select" mask="0x300"/>
          <bitfield name="FCST" caption="Fine Contrast" mask="0x3F0000"/>
          <bitfield name="NSU" caption="Number of Segment Terminals in Use" mask="0x3F000000"/>
        </register>
        <register name="TIM" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Timing Register">
          <bitfield name="PRESC" caption="LCD Prescaler Select" mask="0x1"/>
          <bitfield name="CLKDIV" caption="LCD Clock Division" mask="0xE"/>
          <bitfield name="FC0" caption="Frame Counter 0" mask="0x1F00"/>
          <bitfield name="FC0PB" caption="Frame Counter 0 Prescaler Bypass" mask="0x2000"/>
          <bitfield name="FC1" caption="Frame Counter 1" mask="0x1F0000"/>
          <bitfield name="FC2" caption="Frame Counter 2" mask="0x1F000000"/>
        </register>
        <register name="SR" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="FC0R" caption="Frame Counter 0 Rollover" mask="0x1"/>
          <bitfield name="FC0S" caption="Frame Counter 0 Status" mask="0x2"/>
          <bitfield name="FC1S" caption="Frame Counter 1 Status" mask="0x4"/>
          <bitfield name="FC2S" caption="Frame Counter 2 Status" mask="0x8"/>
          <bitfield name="EN" caption="LCDCA Status" mask="0x10"/>
          <bitfield name="WEN" caption="Wake up Status" mask="0x20"/>
          <bitfield name="BLKS" caption="Blink Status" mask="0x40"/>
          <bitfield name="CSRS" caption="Circular Shift Register Status" mask="0x80"/>
          <bitfield name="CPS" caption="Charge Pump Status" mask="0x100"/>
        </register>
        <register name="SCR" offset="0x10" rw="W" size="4" access-size="4" atomic-op="clear:SR" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="FC0R" caption="Frame Counter 0 Rollover" mask="0x1"/>
        </register>
        <register name="DRL0" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Data Register Low 0">
          <bitfield name="DATA" caption="Segments Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="DRH0" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Data Register High 0">
          <bitfield name="DATA" caption="Segments Value" mask="0xFF"/>
        </register>
