turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC4B.atdf
        <register name="SCR" offset="0x8" rw="W" size="4" access-size="4" atomic-op="clear:SR" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="HCR" caption="Hold Core Register" mask="0x2"/>
          <bitfield name="BERR" caption="Bus error" mask="0x4"/>
          <bitfield name="FAIL" caption="Failure" mask="0x8"/>
          <bitfield name="LCK" caption="Lock error" mask="0x10"/>
        </register>
        <register name="ADDR" offset="0xC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Address Register">
          <bitfield name="ADDR" caption="Address Value" mask="0xFFFFFFFC"/>
        </register>
        <register name="LENGTH" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Length Register">
          <bitfield name="LENGTH" caption="Length Register" mask="0xFFFFFFFC"/>
        </register>
        <register name="DATA" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Data Register">
          <bitfield name="DATA" caption="Generic data register" mask="0xFFFFFFFF"/>
        </register>
        <register name="VERSION" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000100" caption="VERSION register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="CIDR" offset="0xF0" rw="R" size="4" access-size="4" caption="Chip ID Register">
          <bitfield name="VERSION" caption="Version of the Device" mask="0x1F"/>
          <bitfield name="EPROC" caption="Embedded Processor" mask="0xE0"/>
          <bitfield name="NVPSIZ" caption="Nonvolatile Program Memory Size" mask="0xF00"/>
          <bitfield name="NVPSIZ2" caption="Second Nonvolatile Program Memory Size" mask="0xF000"/>
          <bitfield name="SRAMSIZ" caption="Internal SRAM Size" mask="0x1F0000"/>
          <bitfield name="ARCH" caption="Architecture Identifier" mask="0xFE00000"/>
          <bitfield name="NVPTYP" caption="Nonvolatile Program Memory Type" mask="0x70000000"/>
          <bitfield name="EXT" caption="Extension Flag" mask="0x80000000"/>
        </register>
        <register name="EXID" offset="0xF4" rw="R" size="4" access-size="4" caption="Chip ID Extension Register">
          <bitfield name="EXID" caption="Chip ID Extension" mask="0xFFFFFFFF"/>
        </register>
        <register name="IDR" offset="0xFC" rw="R" size="4" access-size="4" initval="0x003E0000" caption="AP Identification register">
          <bitfield name="APIDV" caption="AP Identification Variant" mask="0xF"/>
          <bitfield name="APID" caption="AP Identification" mask="0xF0"/>
          <bitfield name="CLSS" caption="Class" mask="0x10000"/>
          <bitfield name="IC" caption="JEP-106 Identity Code" mask="0xFE0000"/>
          <bitfield name="CC" caption="JEP-106 Continuation Code" mask="0xF000000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000000"/>
        </register>
      </register-group>
    </module>
    <module name="SPI" id="I7602" version="2.1.1" caption="Serial Peripheral Interface">
      <register-group name="SPI" caption="Serial Peripheral Interface">
        <register name="CR" offset="0x0" rw="W" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="SPIEN" caption="SPI Enable" mask="0x1" values="SPI_CR__SPIEN"/>
          <bitfield name="SPIDIS" caption="SPI Disable" mask="0x2" values="SPI_CR__SPIDIS"/>
          <bitfield name="SWRST" caption="SPI Software Reset" mask="0x80" values="SPI_CR__SWRST"/>
          <bitfield name="FLUSHFIFO" caption="Flush FIFO command" mask="0x100"/>
          <bitfield name="LASTXFER" caption="Last Transfer" mask="0x1000000" values="SPI_CR__LASTXFER"/>
        </register>
        <register name="MR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Mode Register">
          <bitfield name="MSTR" caption="Master/Slave Mode" mask="0x1" values="SPI_MR__MSTR"/>
          <bitfield name="PS" caption="Peripheral Select" mask="0x2" values="SPI_MR__PS"/>
          <bitfield name="PCSDEC" caption="Chip Select Decode" mask="0x4" values="SPI_MR__PCSDEC"/>
          <bitfield name="MODFDIS" caption="Mode Fault Detection" mask="0x10" values="SPI_MR__MODFDIS"/>
          <bitfield name="WDRBT" caption="wait data read before transfer" mask="0x20"/>
          <bitfield name="RXFIFOEN" caption="FIFO in Reception Enable" mask="0x40"/>
          <bitfield name="LLB" caption="Local Loopback Enable" mask="0x80" values="SPI_MR__LLB"/>
          <bitfield name="PCS" caption="Peripheral Chip Select" mask="0xF0000"/>
          <bitfield name="DLYBCS" caption="Delay Between Chip Selects" mask="0xFF000000"/>
        </register>
        <register name="RDR" offset="0x8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Receive Data Register">
          <bitfield name="RD" caption="Receive Data" mask="0xFFFF"/>
          <bitfield name="PCS" caption="Peripheral Chip Select" mask="0xF0000"/>
        </register>
        <register name="TDR" offset="0xC" rw="W" size="4" access-size="4" initval="0x00000000" caption="Transmit Data Register">
          <bitfield name="TD" caption="Transmit Data" mask="0xFFFF"/>
          <bitfield name="PCS" caption="Peripheral Chip Select" mask="0xF0000"/>
          <bitfield name="LASTXFER" caption="Last Transfer" mask="0x1000000" values="SPI_TDR__LASTXFER"/>
        </register>
        <register name="SR" offset="0x10" rw="R" size="4" access-size="4" initval="0x000000F0" caption="Status Register">
          <bitfield name="RDRF" caption="Receive Data Register Full" mask="0x1" values="SPI_SR__RDRF"/>
          <bitfield name="TDRE" caption="Transmit Data Register Empty" mask="0x2" values="SPI_SR__TDRE"/>
          <bitfield name="MODF" caption="Mode Fault Error" mask="0x4" values="SPI_SR__MODF"/>
          <bitfield name="OVRES" caption="Overrun Error Status" mask="0x8" values="SPI_SR__OVRES"/>
          <bitfield name="ENDRX" caption="End of RX buffer" mask="0x10" values="SPI_SR__ENDRX"/>
          <bitfield name="ENDTX" caption="End of TX buffer" mask="0x20" values="SPI_SR__ENDTX"/>
          <bitfield name="RXBUFF" caption="RX Buffer Full" mask="0x40" values="SPI_SR__RXBUFF"/>
          <bitfield name="TXBUFE" caption="TX Buffer Empty" mask="0x80" values="SPI_SR__TXBUFE"/>
          <bitfield name="NSSR" caption="NSS Rising" mask="0x100" values="SPI_SR__NSSR"/>
          <bitfield name="TXEMPTY" caption="Transmission Registers Empty" mask="0x200" values="SPI_SR__TXEMPTY"/>
          <bitfield name="UNDES" caption="Underrun Error Status (Slave Mode Only)" mask="0x400"/>
          <bitfield name="SPIENS" caption="SPI Enable Status" mask="0x10000" values="SPI_SR__SPIENS"/>
        </register>
        <register name="IER" offset="0x14" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="RDRF" caption="Receive Data Register Full Interrupt Enable" mask="0x1" values="SPI_IER__RDRF"/>
          <bitfield name="TDRE" caption="Transmit Data Register Empty Interrupt Enable" mask="0x2" values="SPI_IER__TDRE"/>
          <bitfield name="MODF" caption="Mode Fault Error Interrupt Enable" mask="0x4" values="SPI_IER__MODF"/>
          <bitfield name="OVRES" caption="Overrun Error Interrupt Enable" mask="0x8" values="SPI_IER__OVRES"/>
          <bitfield name="ENDRX" caption="End of Receive Buffer Interrupt Enable" mask="0x10" values="SPI_IER__ENDRX"/>
          <bitfield name="ENDTX" caption="End of Transmit Buffer Interrupt Enable" mask="0x20" values="SPI_IER__ENDTX"/>
          <bitfield name="RXBUFF" caption="Receive Buffer Full Interrupt Enable" mask="0x40" values="SPI_IER__RXBUFF"/>
          <bitfield name="TXBUFE" caption="Transmit Buffer Empty Interrupt Enable" mask="0x80" values="SPI_IER__TXBUFE"/>
          <bitfield name="NSSR" caption="NSS Rising Interrupt Enable" mask="0x100" values="SPI_IER__NSSR"/>
          <bitfield name="TXEMPTY" caption="Transmission Registers Empty Enable" mask="0x200" values="SPI_IER__TXEMPTY"/>
          <bitfield name="UNDES" caption="Underrun Error Interrupt Enable" mask="0x400"/>
        </register>
