turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC4B.atdf
      <value-group name="TC_IDR__LDRBS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the RB Load Interrupt (if WAVE:0)." value="1"/>
      </value-group>
      <value-group name="TC_IDR__LOVRS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the Load Overrun Interrupt (if WAVE:0)." value="1"/>
      </value-group>
      <value-group name="TC_IMR__COVFS">
        <value name="0" caption="The Counter Overflow Interrupt is disabled." value="0"/>
        <value name="1" caption="The Counter Overflow Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__CPAS">
        <value name="0" caption="The RA Compare Interrupt is disabled." value="0"/>
        <value name="1" caption="The RA Compare Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__CPBS">
        <value name="0" caption="The RB Compare Interrupt is disabled." value="0"/>
        <value name="1" caption="The RB Compare Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__CPCS">
        <value name="0" caption="The RC Compare Interrupt is disabled." value="0"/>
        <value name="1" caption="The RC Compare Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__ETRGS">
        <value name="0" caption="The External Trigger Interrupt is disabled." value="0"/>
        <value name="1" caption="The External Trigger Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__LDRAS">
        <value name="0" caption="The Load RA Interrupt is disabled." value="0"/>
        <value name="1" caption="The Load RA Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__LDRBS">
        <value name="0" caption="The Load RB Interrupt is disabled." value="0"/>
        <value name="1" caption="The Load RB Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__LOVRS">
        <value name="0" caption="The Load Overrun Interrupt is disabled." value="0"/>
        <value name="1" caption="The Load Overrun Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_BCR__SYNC">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Asserts the SYNC signal which generates a software trigger simultaneously for each of the channels." value="1"/>
      </value-group>
      <value-group name="TC_BMR__TC0XC0S">
        <value name="TCLK0" caption="Select TCLK0 as clock signal 0." value="0"/>
        <value name="NO_CLK" caption="Select no clock as clock signal 0." value="1"/>
        <value name="TIOA1" caption="Select TIOA1 as clock signal 0." value="2"/>
        <value name="TIOA2" caption="Select TIOA2 as clock signal 0." value="3"/>
      </value-group>
      <value-group name="TC_BMR__TC1XC1S">
        <value name="TCLK1" caption="Select TCLK1 as clock signal 1." value="0"/>
        <value name="NO_CLK" caption="Select no clock as clock signal 1." value="1"/>
        <value name="TIOA0" caption="Select TIOA0 as clock signal 1." value="2"/>
        <value name="TIOA2" caption="Select TIOA2 as clock signal 1." value="3"/>
      </value-group>
      <value-group name="TC_BMR__TC2XC2S">
        <value name="TCLK2" caption="Select TCLK2 as clock signal 2." value="0"/>
        <value name="NO_CLK" caption="Select no clock as clock signal 2." value="1"/>
        <value name="TIOA0" caption="Select TIOA0 as clock signal 2." value="2"/>
        <value name="TIOA1" caption="Select TIOA1 as clock signal 2." value="3"/>
      </value-group>
    </module>
    <module name="TRNG" id="I7643" version="1.0.3" caption="True Random Number Generator">
      <register-group name="TRNG" caption="True Random Number Generator">
        <register name="CR" offset="0x0" rw="W" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="ENABLE" caption="Enables the TRNG to provide random values" mask="0x1"/>
          <bitfield name="KEY" caption="Security Key" mask="0xFFFFFF00"/>
        </register>
        <register name="IER" offset="0x10" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="DATRDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="IDR" offset="0x14" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="DATRDY" caption="Data Ready Interrupt Disable" mask="0x1"/>
        </register>
        <register name="IMR" offset="0x18" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="DATRDY" caption="Data Ready Interrupt Mask" mask="0x1"/>
        </register>
        <register name="ISR" offset="0x1C" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="DATRDY" caption="Data Ready Interrupt Status" mask="0x1"/>
        </register>
        <register name="ODATA" offset="0x50" rw="R" size="4" access-size="4" initval="0x00000000" caption="Output Data Register">
          <bitfield name="ODATA" caption="Output Data" mask="0x1"/>
        </register>
        <register name="VERSION" offset="0xFC" rw="R" size="4" access-size="4" initval="0x00000103" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0x70000"/>
        </register>
      </register-group>
    </module>
    <module name="TWIM" id="I7535" version="1.2.0" caption="Two-wire Master Interface">
      <register-group name="TWIM" caption="Two-wire Master Interface">
        <register name="CR" offset="0x0" rw="W" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="MEN" caption="Master Enable" mask="0x1"/>
          <bitfield name="MDIS" caption="Master Disable" mask="0x2"/>
          <bitfield name="SMEN" caption="SMBus Enable" mask="0x10"/>
          <bitfield name="SMDIS" caption="SMBus Disable" mask="0x20"/>
          <bitfield name="SWRST" caption="Software Reset" mask="0x80"/>
          <bitfield name="STOP" caption="Stop the current transfer" mask="0x100"/>
        </register>
        <register name="CWGR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Clock Waveform Generator Register">
          <bitfield name="LOW" caption="Clock Low Cycles" mask="0xFF"/>
          <bitfield name="HIGH" caption="Clock High Cycles" mask="0xFF00"/>
          <bitfield name="STASTO" caption="START and STOP Cycles" mask="0xFF0000"/>
          <bitfield name="DATA" caption="Data Setup and Hold Cycles" mask="0xF000000"/>
          <bitfield name="EXP" caption="Clock Prescaler" mask="0x70000000"/>
        </register>
        <register name="SMBTR" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="SMBus Timing Register">
          <bitfield name="TLOWS" caption="Slave Clock stretch maximum cycles" mask="0xFF"/>
          <bitfield name="TLOWM" caption="Master Clock stretch maximum cycles" mask="0xFF00"/>
          <bitfield name="THMAX" caption="Clock High maximum cycles" mask="0xFF0000"/>
          <bitfield name="EXP" caption="SMBus Timeout Clock prescaler" mask="0xF0000000"/>
        </register>
        <register name="CMDR" offset="0xC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Command Register">
          <bitfield name="READ" caption="Transfer Direction" mask="0x1"/>
          <bitfield name="SADR" caption="Slave Address" mask="0x7FE"/>
          <bitfield name="TENBIT" caption="Ten Bit Addressing Mode" mask="0x800"/>
          <bitfield name="REPSAME" caption="Transfer is to same address as previous address" mask="0x1000"/>
          <bitfield name="START" caption="Send START condition" mask="0x2000"/>
          <bitfield name="STOP" caption="Send STOP condition" mask="0x4000"/>
          <bitfield name="VALID" caption="CMDR Valid" mask="0x8000"/>
          <bitfield name="NBYTES" caption="Number of data bytes in transfer" mask="0xFF0000"/>
          <bitfield name="PECEN" caption="Packet Error Checking Enable" mask="0x1000000"/>
          <bitfield name="ACKLAST" caption="ACK Last Master RX Byte" mask="0x2000000"/>
          <bitfield name="HS" caption="HS-mode" mask="0x4000000"/>
          <bitfield name="HSMCODE" caption="HS-mode Master Code" mask="0x70000000"/>
        </register>
        <register name="NCMDR" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Next Command Register">
          <bitfield name="READ" caption="Transfer Direction" mask="0x1"/>
          <bitfield name="SADR" caption="Slave Address" mask="0x7FE"/>
          <bitfield name="TENBIT" caption="Ten Bit Addressing Mode" mask="0x800"/>
          <bitfield name="REPSAME" caption="Transfer is to same address as previous address" mask="0x1000"/>
          <bitfield name="START" caption="Send START condition" mask="0x2000"/>
          <bitfield name="STOP" caption="Send STOP condition" mask="0x4000"/>
          <bitfield name="VALID" caption="CMDR Valid" mask="0x8000"/>
          <bitfield name="NBYTES" caption="Number of data bytes in transfer" mask="0xFF0000"/>
          <bitfield name="PECEN" caption="Packet Error Checking Enable" mask="0x1000000"/>
          <bitfield name="ACKLAST" caption="ACK Last Master RX Byte" mask="0x2000000"/>
          <bitfield name="HS" caption="HS-mode" mask="0x4000000"/>
          <bitfield name="HSMCODE" caption="HS-mode Master Code" mask="0x70000000"/>
        </register>
