turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC4B.atdf
        <register name="UPINRQ2" offset="0x658" rw="RW" size="4" access-size="4" initval="0x00000001" caption="Pipe In Request">
          <bitfield name="INRQ" caption="IN Request Number before Freeze" mask="0xFF"/>
          <bitfield name="INMODE" caption="IN Request Mode" mask="0x100"/>
        </register>
        <register name="UPINRQ3" offset="0x65C" rw="RW" size="4" access-size="4" initval="0x00000001" caption="Pipe In Request">
          <bitfield name="INRQ" caption="IN Request Number before Freeze" mask="0xFF"/>
          <bitfield name="INMODE" caption="IN Request Mode" mask="0x100"/>
        </register>
        <register name="UPINRQ4" offset="0x660" rw="RW" size="4" access-size="4" initval="0x00000001" caption="Pipe In Request">
          <bitfield name="INRQ" caption="IN Request Number before Freeze" mask="0xFF"/>
          <bitfield name="INMODE" caption="IN Request Mode" mask="0x100"/>
        </register>
        <register name="UPINRQ5" offset="0x664" rw="RW" size="4" access-size="4" initval="0x00000001" caption="Pipe In Request">
          <bitfield name="INRQ" caption="IN Request Number before Freeze" mask="0xFF"/>
          <bitfield name="INMODE" caption="IN Request Mode" mask="0x100"/>
        </register>
        <register name="UPINRQ6" offset="0x668" rw="RW" size="4" access-size="4" initval="0x00000001" caption="Pipe In Request">
          <bitfield name="INRQ" caption="IN Request Number before Freeze" mask="0xFF"/>
          <bitfield name="INMODE" caption="IN Request Mode" mask="0x100"/>
        </register>
        <register name="UPINRQ7" offset="0x66C" rw="RW" size="4" access-size="4" initval="0x00000001" caption="Pipe In Request">
          <bitfield name="INRQ" caption="IN Request Number before Freeze" mask="0xFF"/>
          <bitfield name="INMODE" caption="IN Request Mode" mask="0x100"/>
        </register>
        <register name="USBCON" offset="0x800" rw="RW" size="4" access-size="4" initval="0x01004000" caption="General Control Register">
          <bitfield name="FRZCLK" caption="Freeze USB Clock" mask="0x4000"/>
          <bitfield name="USBE" caption="USBC Enable" mask="0x8000"/>
          <bitfield name="UIMOD" caption="USBC Mode" mask="0x1000000"/>
        </register>
        <register name="USBSTA" offset="0x804" rw="R" size="4" access-size="4" initval="0x00010000" caption="General Status Register">
          <bitfield name="VBUSRQ" caption="VBus Request" mask="0x200"/>
          <bitfield name="SPEED" caption="Speed Status" mask="0x3000" values="USBC_USBSTA__SPEED"/>
          <bitfield name="CLKUSABLE" caption="USB Clock Usable" mask="0x4000"/>
          <bitfield name="SUSPEND" caption="Suspend module state" mask="0x10000"/>
        </register>
        <register name="USBSTACLR" offset="0x808" rw="W" size="4" access-size="4" atomic-op="clear:USBSTA" initval="0x00000000" caption="General Status Clear Register">
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x100"/>
          <bitfield name="VBUSRQC" caption="VBUSRQ Clear" mask="0x200"/>
        </register>
        <register name="USBSTASET" offset="0x80C" rw="W" size="4" access-size="4" atomic-op="set:USBSTA" initval="0x00000000" caption="General Status Set Register">
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x100"/>
          <bitfield name="VBUSRQS" caption="VBUSRQ Set" mask="0x200"/>
        </register>
        <register name="UVERS" offset="0x818" rw="R" size="4" access-size="4" initval="0x00000310" caption="IP Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0x70000"/>
        </register>
        <register name="UFEATURES" offset="0x81C" rw="R" size="4" access-size="4" initval="0x00000007" caption="IP Features Register">
          <bitfield name="EPTNBRMAX" caption="Maximum Number of Pipes/Endpints" mask="0xF"/>
          <bitfield name="UTMIMODE" caption="UTMI Mode" mask="0x100"/>
        </register>
        <register name="UADDRSIZE" offset="0x820" rw="R" size="4" access-size="4" initval="0x00001000" caption="IP PB address size Register">
          <bitfield name="UADDRSIZE" caption="IP PB Address Size" mask="0xFFFFFFFF"/>
        </register>
        <register name="UNAME1" offset="0x824" rw="R" size="4" access-size="4" initval="0x48555342" caption="IP Name Part One: HUSB">
          <bitfield name="UNAME1" caption="IP Name Part One" mask="0xFFFFFFFF"/>
        </register>
        <register name="UNAME2" offset="0x828" rw="R" size="4" access-size="4" initval="0x484F5354" caption="IP Name Part Two: HOST">
          <bitfield name="UNAME2" caption="IP Name Part Two" mask="0xFFFFFFFF"/>
        </register>
        <register name="USBFSM" offset="0x82C" rw="R" size="4" access-size="4" initval="0x00000009" caption="USB internal finite state machine">
          <bitfield name="DRDSTATE" caption="DualRoleDevice state" mask="0xF" values="USBC_USBFSM__DRDSTATE"/>
        </register>
        <register name="UDESC" offset="0x830" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Endpoint descriptor table">
          <bitfield name="UDESCA" caption="USB Descriptor Address" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="USBC_UECFG0__EPBK">
        <value name="SINGLE" value="0"/>
        <value name="DOUBLE" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG0__EPDIR">
        <value name="OUT" value="0"/>
        <value name="IN" value="1"/>
      </value-group>
      <value-group name="USBC_UECFG0__EPSIZE">
        <value name="8" value="0"/>
        <value name="16" value="1"/>
        <value name="32" value="2"/>
        <value name="64" value="3"/>
        <value name="128" value="4"/>
        <value name="256" value="5"/>
        <value name="512" value="6"/>
        <value name="1024" value="7"/>
      </value-group>
      <value-group name="USBC_UECFG0__EPTYPE">
        <value name="CONTROL" value="0"/>
        <value name="ISOCHRONOUS" value="1"/>
        <value name="BULK" value="2"/>
        <value name="INTERRUPT" value="3"/>
      </value-group>
